
public class DMMpractice11 {

	public static void main(String[] args) {
		System.out.println(
				"クラスのメンバーは、何と何ですか？"
				+ "\nアクセス修飾子は、何種類ありますか？"
				+ "\nアクセス修飾子で、クラスに定義できるのは何と何ですか？"
				+ "\nインスタンス生成時に呼び出されるメソッドを何と呼びますか？"
				+ "\nディレクトリ階層でクラスをグループ化するしくみを何と呼びますか？"
				+ "\nクラスで定義された変数を何変数と呼びますか？"
				+ "\nメソッド内で定義された変数を何変数と呼びますか？"
				+ "\nクラスから直接呼び出しができるメソッドを何と呼びますか？"
				+ "\nチェックする必要がない例外を何と呼びますか？"
				+ "\nオブジェクト指向は、プログラムを何に見立ててプログラミングしますか？"
				+ "\nJavaで「型」というと、何を指しますか？"
				+ "\nクラスを実体化したものを何と呼びますか？");
	}

}
