
public class DMMpractice11 {

	public static void main(String[] args) {
		System.out.println(
				"1クラスのメンバーは、何と何ですか？フィールドとメゾット"
				+ "\n2アクセス修飾子は、何種類ありますか？「public」「protected」「package-private」「private」の4種類"
				+ "\n3アクセス修飾子で、クラスに定義できるのは何と何ですか？「public」と「package-private」の2種類"
				+ "\n4インスタンス生成時に呼び出されるメソッドを何と呼びますか？コンストラクタ"
				+ "\n5ディレクトリ階層でクラスをグループ化するしくみを何と呼びますか？パッケージ"
				+ "\n6クラスで定義された変数を何変数と呼びますか？メンバ変数"
				+ "\n7メソッド内で定義された変数を何変数と呼びますか？ローカル変数"
				+ "\n8クラスから直接呼び出しができるメソッドを何と呼びますか？static(スタティック)メソッド"
				+ "\n9チェックする必要がない例外を何と呼びますか？ランタイム例外（RuntimeException）"
				+ "\n10オブジェクト指向は、プログラムを何に見立ててプログラミングしますか？もの（オブジェクト）"
				+ "\n11Javaで「型」というと、何を指しますか？クラス"
				+ "\n12クラスを実体化したものを何と呼びますか？インスタンス");
	}

}
